Core/src/InformationRegisters/AzRyНапоминанияПользователя/AzRyНапоминанияПользователя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>AzRyНапоминанияПользователя</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ВремяСобытия</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособУстановкиВремениНапоминания</name>
    <type>
      <types>EnumRef.СпособыУстановкиВремениНапоминания</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнтервалВремениНапоминания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяРеквизитаИсточника</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Расписание</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникВерсияДанных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автор2</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеИсточника</name>
    <comment>Представление источника</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>СтатусНапоминания</name>
    <type>
      <types>EnumRef.AzRyСтатусНапоминания</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Получатель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Отправитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Источник</name>
    <type>
      <types>ExchangePlanRef</types>
      <types>BusinessProcessRef</types>
      <types>DocumentRef</types>
      <types>ChartOfCalculationTypesRef</types>
      <types>TaskRef</types>
      <types>ChartOfCharacteristicTypesRef</types>
      <types>ChartOfAccountsRef</types>
      <types>CatalogRef</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Core/src/Enums/AzRyСтатусНапоминания/AzRyСтатусНапоминания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>AzRyСтатусНапоминания</name>
  <enumValues>
    <name>ОжидаетПодтверждения</name>
  </enumValues>
  <enumValues>
    <name>ПодтверждениеОдобрено</name>
  </enumValues>
  <enumValues>
    <name>ПодтверждениеНеОдобрено</name>
  </enumValues>
  <enumValues>
    <name>Finnished</name>
  </enumValues>
</mdclass:Enum>

Core/src/InformationRegisters/AzRyНапоминанияПользователя/ManagerModule.bsl
Функция ЗаписьИмеется(СтатусНапоминания, Получатель, Отправитель, Источник)

		

КонецФункции

Функция ОбновитьЗаписьПослеПроведенияДокумента(СтатусНапоминания, Источник) Экспорт

	НаборЗаписей = РегистрыСведений.AzRyНапоминанияПользователя.СоздатьНаборЗаписей();    
	НаборЗаписей.Отбор.СтатусНапоминания.Установить(СтатусНапоминания);
	НаборЗаписей.Отбор.Источник.Установить(Источник);
	НаборЗаписей.Прочитать();
	
	МенеджерЗаписи = РегистрыСведений.AzRyНапоминанияПользователя.СоздатьМенеджерЗаписи();
	
	Для Каждого ТекЗапись Из НаборЗаписей Цикл
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ТекЗапись);
		МенеджерЗаписи.Прочитать();
		МенеджерЗаписи.СтатусНапоминания = Перечисления.AzRyСтатусНапоминания.Finnished;
		МенеджерЗаписи.Период = ТекущаяДата();
		МенеджерЗаписи.Записать();
	КонецЦикла;	

КонецФункции
